backend/app/controllers/groups_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "ken@email.com"], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"
---
   def index
      if params[:user_id]
         @groups = Group.joins(:users).where('user_id = ?', params[:user_id])
      else
         @groups = Group.all

INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Yin Yoga"], ["created_at", "2018-01-18 21:09:57.392895"], ["updated_at", "2018-01-18 21:09:57.392895"]]
---
   def create
      @group = Group.create!(group_params)

UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["name", "Vinyasa Yoga"], ["updated_at", "2018-01-18 21:10:31.293780"], ["id", 1]]
---
   def update
      @group.update(group_params)

DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]
---
   def destroy
      @group.destroy

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def set_group
      @group = Group.find(params[:id])