backend/app/controllers/sendees_controller.rb

INSERT INTO "sendees" ("sub_request_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sub_request_id", 1], ["user_id", 1], ["created_at", "2018-01-24 00:22:10.181287"], ["updated_at", "2018-01-24 00:22:10.181287"]]
---
  def create
     @sendee = Sendee.create!(sendee_params)

UPDATE "sendees" SET "sub" = ?, "sub_request_id" = ?, "updated_at" = ? WHERE "sendees"."id" = ?  [["sub", "t"], ["sub_request_id", 1], ["updated_at", "2018-01-24 19:35:14.708037"], ["id", 1]]
---
  def update
     before_sub_val = @sendee.sub
     before_confirmed_val = @sendee.confirmed

     @sendee.update!(sendee_params)

SELECT  "sendees".* FROM "sendees" WHERE "sendees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_sendee
     @sendee = Sendee.find(params[:id])