backend/app/controllers/sub_requests_controller.rb

   def index
      if params[:scope] == "incomplete"
         user_requests = SubRequest.where('user_id = ? AND start_date_time >= ?', current_user.id, Time.now.to_date)
         @sent_sub_requests = {}
         sent_count = 0
            user_requests.each do |request|
               complete = false
               request.sendees.each do |sendee|
                  if sendee.confirmed == true
                     complete = true
                  end
               end

               if complete == false
                  count += 1
                  @sent_sub_requests[sent_count] = request
               end
            end

         other_requests = SubRequest.where('start_date_time >= ?', Time.now.to_date).joins(:sendees).where('sendees.user_id = ?', current_user.id)
         @incoming_sub_requests = {}
         incoming_count = 0
         other_requests.each do |request|
---
SELECT "sub_requests".* FROM "sub_requests"
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "ken@email.com"], ["LIMIT", 1]]

   def send_to_sendees
      @sub_request = SubRequest.find(params[:sub_request_id])
      @group = Group.find(@sub_request.group_id)
      @sendees = {}
      @group.users.each_with_index do |sendee, index|
         @sendees[index] = Sendee.create!(user: sendee, sub_request: @sub_request, sub: false)
---
SELECT  "sub_requests".* FROM "sub_requests" WHERE "sub_requests"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sendees" ("sub_request_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sub_request_id", 1], ["user_id", 1], ["created_at", "2018-01-24 02:42:51.219883"], ["updated_at", "2018-01-24 02:42:51.219883"]]