backend/app/controllers/users_controller.rb

   def index
      @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "ken@email.com"], ["LIMIT", 1]]

   def create
      @user = User.create!(
         staff_id_mb: params[:mb_id],
         first_name: params[:first_name],
         last_name: params[:last_name],
         email: params[:email],
         password: params[:password],
      )
---
INSERT INTO "users" ("staff_id_mb", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["staff_id_mb", 100000333], ["first_name", "Kali"], ["last_name", "Shakti"], ["created_at", "2018-01-19 20:52:18.616445"], ["updated_at", "2018-01-19 20:52:18.616445"]]

   def update
      @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Lakshmi"], ["updated_at", "2018-01-19 20:53:01.783818"], ["id", 1]]